#include 包含   #ifndef   #define(只是单纯的替换)       所有带#的都属于预编译范畴
基本数据类型 short int long float double char   构造类型 数组  struct union enun  指针   空类型 void
变量 定义
        【存储类型】 数据类型 标识符=值    type name=value（【】可以省略的）
         标识符，见名知意
         数据类型： 基本型+构造型
         存储类型：  
                  auto（默认：自动分配自动释放）      
                  static（静态型，会自动初始化初值为零，并且变量的值具有继承性，使用同一块空间）
                  register（建议型：寄存器类型，只能定义局部变量，不能定义全局，大小当前是几位机器，就是几位，没有地址）    
                  extern（说明型，不能改变被说明的变量和值）      
          生命周期和作用范围
            全局变量用于整个程序，局部变量直到程序块执行结束，内部的作用范围屏蔽外部的
 运算符
        算数                   + - * / % ++ -- 
        关系                   < > <= >= != 
        逻辑                   && || ！
        位                     << >> ~ | ^ & 
        赋值                   =
        条件                   ？：
        逗号                   ，
        指针                   * & 
        求字节                 sizeof
        强制类型转换          （类型）
        分量                   ->
        下标                   []
        其他                  （）
